// Understand the Problem

// 어떠한 문제를 마주칠때 우선 해야할 것은 문제를 이해하는 것이다.
// 1. 면접관의 말을 그대로 생각하는 게 아닌 나만의 방식으로 바꿔서 질문이 무엇인지를 실제로 이해하자
// 2. 입력 값이 무엇이고 출력 값이 무엇이여야 할까?
// 3. 출력 값이 입력 값으로부터 정의될 수 있을까? 또한 내가 문제를 풀기위해 충분한 정보가 있는가?
// 4. 문제의 일부인 데이터의 중요한 부분에 어떻게 라벨을 지정할 수 있을까? -> 문제에서 정말 중요한 것은 무엇일까

// ex. 두 숫자를 가지고 합계를 반환하는 함수를 작성해보자!

// 1. 나의 방식으로 숫자를 더하거나 덧셈을 수행하는 함수를 작성하자.
// 2. 입력 값과 출력 값의 타입과 입력 방법에 대해 생각해보자.
// 3. 문제에 대해 충분한 정보가 있는지 생각해보자.
// 4. 무엇이 중요한가 생각해보자. 출력 값과 입력 값에 대해 생각해서 생각해서 어떻게 나와야하는지 생각하면 문제를 풀기 쉽다.

